# Aggregations

### Step 1. Import the necessary libraries

In [2]:
import math
import array
import numpy as np
from itertools import permutations
from random import shuffle
import random
import pprint
import re
import pandas as pd

### Step 2. Import the dataset occupation.csv from the folder or [here](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [3]:
users=pd.read_csv('occupation.csv',sep="|")

### Step 3. Assign it to a variable called users.

In [4]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [5]:
df1=users.groupby(by=['occupation'])[['age']].mean().add_prefix('Mean_of').reset_index()

In [6]:
df1.head()

      occupation  Mean_ofage
0  administrator   38.746835
1         artist   31.392857
2         doctor   43.571429
3       educator   42.010526
4       engineer   36.388060

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least.

Use numpy.where() to encode gender column.

In [8]:
users_M= users[users.gender=='M']

In [30]:
 Male_ratio = users_M.groupby(by=['occupation'])[['gender']].count()/len(users_M)

In [34]:
M_ratio=Male_ratio.sort_values(by='gender', ascending=False).reset_index()

### Step 6. For each occupation, calculate the minimum and maximum ages

In [41]:
df3=users.groupby('occupation')['age'].agg([pd.np.min, pd.np.max, ]).add_prefix('Age_of_').reset_index()

In [43]:
df3.head()

      occupation  Age_of_amin  Age_of_amax
0  administrator           21           70
1         artist           19           48
2         doctor           28           64
3       educator           23           63
4       engineer           22           70

### Step 7. For each combination of occupation and gender, calculate the mean age

In [45]:
df2=users.groupby(by=['occupation','gender'])[['age']].mean().add_prefix('Mean_of').reset_index()

In [46]:
df2.head()

      occupation gender  Mean_ofage
0  administrator      F   40.638889
1  administrator      M   37.162791
2         artist      F   30.307692
3         artist      M   32.333333
4         doctor      M   43.571429

### Step 8.  For each occupation present the percentage of women and men

In [12]:
count = users[['occupation','gender']].groupby(['occupation']).agg('count')

In [13]:
count_M_F = pd.crosstab(users.occupation,users.gender)

In [14]:
perc_M_F = pd.merge(count,count_M_F,on= 'occupation', how='inner')

In [15]:
perc_M_F.head()

               gender   F   M
occupation
administrator      79  36  43
artist             28  13  15
doctor              7   0   7
educator           95  26  69
engineer           67   2  65

In [16]:

perc_M_F['perc_F'] = (perc_M_F.F/perc_M_F.gender)*100
perc_M_F['perc_M'] = (perc_M_F.M/perc_M_F.gender)*100